{
  "gradeLevel": "elementary",
  "lessons": [
    {
      "id": "elementary-lesson-1",
      "title": "What is Mass?",
      "content": [
        "## Understanding Mass",
        "",
        "Mass is the amount of matter (stuff) in an object. Everything around you has mass - your desk, your pencil, even the air you breathe!",
        "",
        "### Why Mass Matters in Space",
        "",
        "In space, mass is super important because:",
        "- Objects with more mass have stronger gravity",
        "- Mass determines whether something can become a star",
        "- The mass of an object affects its color and temperature",
        "",
        "### Measuring Cosmic Mass",
        "",
        "Scientists measure the mass of space objects by comparing them to our Sun:",
        "- **Solar Mass (M☉)**: The mass of our Sun",
        "- Earth = 0.000003 M☉ (very tiny compared to the Sun!)",
        "- Jupiter = 0.001 M☉ (1000 times less than the Sun)",
        "",
        "**Try it yourself:** Move the slider to see objects of different masses!"
      ]
    },
    {
      "id": "elementary-lesson-2",
      "title": "Planets: The Lightweights",
      "content": [
        "## What Makes a Planet?",
        "",
        "Planets are objects that orbit stars. They're much smaller than stars and don't make their own light.",
        "",
        "### Types of Planets",
        "",
        "**Rocky Planets** (like Earth and Mars):",
        "- Very small mass (less than 0.00001 M☉)",
        "- Made of rock and metal",
        "- Have solid surfaces you could walk on",
        "",
        "**Gas Giants** (like Jupiter and Saturn):",
        "- Bigger mass (around 0.001 M☉)",
        "- Made mostly of gas",
        "- No solid surface - you'd fall right through!",
        "",
        "### Why Planets Don't Shine",
        "",
        "Planets don't have enough mass to create fusion in their cores. That's why they don't glow like stars - they only reflect light from their star!",
        "",
        "**Activity:** Set the mass to 0.000003 (Earth) and then to 0.001 (Jupiter). Notice the difference!"
      ]
    },
    {
      "id": "elementary-lesson-3",
      "title": "Brown Dwarfs: Failed Stars",
      "content": [
        "## What is a Brown Dwarf?",
        "",
        "Brown dwarfs are sometimes called \"failed stars.\" They're bigger than planets but smaller than stars.",
        "",
        "### The In-Between Objects",
        "",
        "Brown dwarfs have a mass between 0.013 and 0.08 M☉. That's:",
        "- About 13 to 80 times the mass of Jupiter",
        "- Not quite enough mass to be a real star",
        "- Too much mass to be a planet",
        "",
        "### Why They Failed",
        "",
        "To be a real star, you need enough mass to start fusion (combining atoms to make energy). Brown dwarfs almost made it, but they're just a bit too small!",
        "",
        "They glow a little bit from leftover heat from when they formed, but they get cooler and dimmer over time.",
        "",
        "**Fun fact:** Brown dwarfs can be the same size as Jupiter, but they're much heavier (more mass in the same space)!"
      ]
    },
    {
      "id": "elementary-lesson-4",
      "title": "Stars: The Bright Giants",
      "content": [
        "## What Makes a Star Shine?",
        "",
        "Stars are giant balls of hot, glowing gas. They make their own light through a process called fusion!",
        "",
        "### The Mass Requirement",
        "",
        "To be a star, an object needs at least 0.08 M☉ (about 80 times Jupiter's mass). With this much mass, the core gets so hot and squeezed that fusion starts!",
        "",
        "### Different Star Sizes",
        "",
        "**Red Dwarfs** (0.08 - 0.45 M☉):",
        "- The smallest, coolest stars",
        "- Glow red or orange",
        "- Live for trillions of years!",
        "",
        "**Sun-like Stars** (0.45 - 8 M☉):",
        "- Medium-sized stars (like our Sun)",
        "- Glow yellow or white",
        "- Live for billions of years",
        "",
        "**Massive Stars** (8+ M☉):",
        "- The biggest, hottest stars",
        "- Glow blue-white",
        "- Live only millions of years (they burn fast!)",
        "",
        "**Remember:** More massive stars burn brighter but die faster!"
      ]
    },
    {
      "id": "elementary-lesson-5",
      "title": "Black Holes: Where Mass Wins",
      "content": [
        "## The Ultimate Gravity Trap",
        "",
        "Black holes are the strangest objects in space. They have SO much mass packed into a tiny space that nothing can escape - not even light!",
        "",
        "### How Black Holes Form",
        "",
        "When a massive star (more than 20 M☉) runs out of fuel, it collapses and creates a black hole. All that mass gets squeezed into an incredibly small point!",
        "",
        "### Why They're Black",
        "",
        "Black holes have such strong gravity that even light can't escape. That's why they look completely black - no light comes out!",
        "",
        "### The Accretion Disk",
        "",
        "Matter falling into a black hole forms a spinning disk around it called an accretion disk. This disk gets so hot that it glows brightly - even though the black hole itself is dark!",
        "",
        "**Amazing fact:** If you could put all of Earth's mass into a ball the size of a marble, it would be a black hole!",
        "",
        "**Try it:** Set the mass to 10 M☉ to see a black hole with its glowing accretion disk!"
      ]
    }
  ]
}
